@extends('layouts.app')
@section('title', " باقات السيرفرات"))


<!-- Main content -->
@section('content')


    <head>
        <link rel="stylesheet" href="{{ asset('css/home.css') }}">
    </head>

    <div class="howtocontainer">
        <!-- Start Onoo Services -->
        <div class="HomeCardOnoo card"
            style="width:96% !important;height:45px !important;min-height:unset;text-align: center;color: mintcream;font-size: 17px;">
            <label style="text-align: center;color: mintcream;font-size: 17px;">
               باقات السيرفرات
            </label>
            <span class="loader"></span>
        </div>

        <div id="faq" class="faq-body">



            <div class="faq-list">
                تقدم شركة اونو للبرمجيات باقات مختلفة للسيرفرات او خدمة الكلاود ، لتلبيه احتياجات عملائنا الكرام 
                وفيما يلي شرح مختصر لما هو خدمة الكلاود و مصطلحاته


                <div>
                    <details style="padding: 10px;" >
                        <summary style="margin-bottom: 10px" title=" اولاً : ما هى خدمة باقات السيرفرات ؟">
                            اولاً : ما هى خدمة باقات السيرفرات ؟
                        </summary>

                        <p class="faq-content">
                            تتكون كل باقه من 
                            * خدمة السيرفر(الكلاود)
                            * خدمة الدعم الفني عن طريق تذاكر الدعم الفني
                            * ادارة وصيانة ومتابعة السيرفرات على مدار الساعه
                            * خدمة التحديثات المجانية للسيستم
                        </p>
                    </details>

                    <details style="padding: 10px;" >
                        <summary style="margin-bottom: 10px" title="ثانياً : ما هي خدمة الكلاود  و كيف يعمل سيستم براند من اي مكان فى العالم و من اي جهاز الكتروني ؟">
                            ثانياً : ما هي خدمة الكلاود  و كيف يعمل سيستم براند من اي مكان فى العالم و من اي جهاز الكتروني ؟ 
                        </summary>
                        <p class="faq-content">
                            الكلاود هو عبارة عن جهاز كمبيوتر مثل الاجهزة العاديه ولكن بمواصفات ضخمة ، وسرعه انترنت عالية ، ويعمل علي مدار 24 ساعه 365 يوم
في اماكن تسمي داتا سنتر - DataCenter مجهزة لتشغيل تلك السيرفرات - اجهزة الكمبيوتر -   ويتم تاجير تلك السيرفرات من خلالها شهرياً 

ملحوظة : تقدم شركة اونو للبرمجيات خدمات  الكلاود من خلال شركة كونتابو الالمانية
www.contabo.com 
                        </p>
                    </details>


                    <details style="padding: 10px;" >
                        <summary style="margin-bottom: 10px" title="ثالثاً : ما هى انواع ومواصفات السيرفرات و ما الذي يتحكم في سرعه سيستم براند ؟">
                            ثالثاً : ما هى انواع ومواصفات السيرفرات و ما الذي يتحكم في سرعه سيستم براند ؟ 
                        </summary>
                        <p class="faq-content">
                            تختلف السيرفرات في انواعها وفي مواصفاتها فيوجد مثلا 
shared hosting - vps - Dedicated server - الي اخرة، وكل نوع من تلك الانواع له المواصفات الخاصه به 
مثل المعالج والرام، وهو ما يتحكم في عاملين مهمين لسرعه واستقرار السيستم

-- و يتحكم في السرعه اكثر من عامل ومنهم

- ما هو حجم المعالج والرام للسيرفر؟
- ما هي سرعه الشبكة والترافيك للسيرفر؟
- ما هو عدد وحجم الطلبات في الثانيه / الامر؟
مثال : عند عمل فاتورة مبيعات، يقوم المستخدم الواحد للفرع او النشاط في نقطة البيع بارسال 10 طلبات بحد ادني، مثل فحص الحد الائتماني للعميل وفحص رصيد مخزون المنتج وجلب بيانات المنتج رادخالها في الفاتورة وعمليات اخري كثيرة تحدث في الخلفيه، نطلق عليها 
Request - طلب
- اجمالى عدد المستخدمين علي السيرفر
- اجمالي عدد الطلبات لجميع المستخدمين علي السيرفر
 
                        </p>
                    </details>


                    <details style="padding: 10px;" >
                        <summary style="margin-bottom: 10px" title="رابعاً :ما هو  بين باقات السيرفرات وما هو عدد العمليات و معدل الاستجابة ؟">
                            رابعاً :ما هو  بين باقات السيرفرات وما هو عدد العمليات و معدل الاستجابة ؟ 
                        </summary>
                        <p class="faq-content">
                            تسهيلاً علي عملائنا تم وضع معدل للاستجابه وعدد العمليات لكل سيرفر ، فما معني ذلك ؟ 

1 - عدد العمليات :- 
تم وضع لكل سيرفر حد اقصي لعدد العمليات ، مع تحديد حد اقصي لعدد العمليات لكل نشاط 
مثال :-
تم وضع حد اقصي 100 الف عملية فى الثانية لسيرفر OnooPlus مع تحديد امكانية 70 عملية  فى الثانية لكل نشاط 
مع ملاحظة ان عند الوصول للحد الاقصي للنشاط ، فأن معدل الاستجابة يكون اطول ، حتي يكون هناك امكانية لتنفيذ العمليات 
الاضافية 

2 - معدل الاستجابة :-
تم حساب المعدل الطبيعي لتوقيت تحميل كل امر فى السيستم ، فى حالة استقرار الانترنت عند المستخدم وعدم وجود اى مشاكل
فمثلاً عند فتح تقرير المخزون على سيرفر OnooPlus قد يستغرق تحميل الصفحة من 5 ثوانى الى 15 ثانية
على حسب كم البيانات ، 
 
                        </p>
                    </details>

                </div>

            </div>
        </div>


    </div>
    </div>
    <!-- End Onoo Services -End -->
    </div>
@endsection
